app/controllers/dash_controller.rb

  def view
  	@user = User.all
---
SELECT  "users".* FROM "users"  WHERE (2) LIMIT 1