app/controllers/users_controller.rb

SELECT "users".* FROM "users"  WHERE (email like '%Shrey%')  ORDER BY created_at DESC
---
  def index
    @users = User.all

INSERT INTO "users" ("about", "created_at", "email", "image", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "image" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["image", "1780676_795595127170602_5362898941795603773_n.jpg"], ["password_digest", "$2a$10$Iq8JLZ38tALYKY6rTh/gduDOt1YzQQFKYdXru1oUCS1bTH7wRCHvq"], ["updated_at", "2014-10-10 10:15:11.009447"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)